[
  {
    "name": "Google Analytics Filter Tool",
    "description": "Managing Google Analytics Filters can be a time consuming tasks when dealing with multiple accounts and properties. I designed and developed a tool to help streamline Google Analytics Filter Management to save companies time and money whenever Filters need to be updated.",
    "imgLink": "https://source.unsplash.com/random/1920x1080",
    "gitHubLink": "",
    "checkItOutLink": "",
    "projId": "capstone",
    "youtubeLink": ""
  },
  {
    "name": "War in a Single Array",
    "description": "Was challenged by my instructor to re-create the card game “War”, but instead of using multiple arrays to handle the player/computer hands and the cards currently being battled, I could only use a single array. This was accomplished this with some fancy math that determines the cards that are being battled, offsets for ties, and utilizing splice, unshift, and push.",
    "imgLink": "https://source.unsplash.com/random/1920x1080",
    "gitHubLink": "https://github.com/NickRyanWeber/react-war",
    "checkItOutLink": "https://react-war-project.nicholasryanweber.com/",
    "projId": "war",
    "youtubeLink": ""
  },
  {
    "name": "Stack-Overflow Clone",
    "description": "A team project at Suncoast Developers Guild, where we were to build a clone of stack-overflow using a React front-end and C#/.Net for the back end. My teammate and I evenly split the front and back end work, starting our designs in Figma, and eventually deploying with Netlify and Heroku.",
    "imgLink": "https://source.unsplash.com/random/1920x1080",
    "gitHubLink": "https://github.com/NickRyanWeber/SDG-overflow",
    "checkItOutLink": "",
    "projId": "stack-over",
    "youtubeLink": ""
  },
  {
    "name": "Analytics Report Automation",
    "description": "Automated and standardized analytics reporting. Previously analytics reports weren’t standardized so a significant amount of time was spent determining what would need to be collected and shown and how often it needed to be shown. I audited past reports and interviewed our clients and Accounts Team to standardize the analytics reports, then custom built a solution using various APIs, Google App Scripts and Google Data Studio that provided up-to-yesterday analytics for everyone",
    "imgLink": "https://source.unsplash.com/random/1920x1080",
    "gitHubLink": "",
    "checkItOutLink": "",
    "projId": "analytics",
    "youtubeLink": ""
  },
  {
    "name": "Time Report Automation",
    "description": "My company's leadership spent a lot of time exporting reports from Harvest into Excel and then building multiple reports and charts from that data. Using Google App Scripts I pulled that data from Harvest's API into Google Sheets, created the same reports and made interactive charts using Google Data Studio. This turned a manual process into a daily automated job, reducing the time spent while increasing accessibility and ease-of-use of the data.",
    "imgLink": "https://source.unsplash.com/random/1920x1080",
    "gitHubLink": "",
    "checkItOutLink": "",
    "projId": "time-report",
    "youtubeLink": ""
  },
  {
    "name": "Twilio Schedule Reminder",
    "description": "Introduced a solution to help keep staff aware of the current schedule of events at Zydeco Brew Werks. Previously, whenever a new event was scheduled, everyone was updated via email about the new event. This made it so each staff member was responsible for maintaining their own calendar of events. My solution used a shared Google Calendar that the staff could subscribe to, and utilizing Google Sheets, Google App Scripts, and Twilio, the staff now get a weekly text-message with the upcoming schedule for the week. While small, this automation has helped keep everyone on the same page and prepared for the week.",
    "imgLink": "https://source.unsplash.com/random/1920x1080",
    "gitHubLink": "",
    "checkItOutLink": "",
    "projId": "twilio",
    "youtubeLink": ""
  }
]
